{
  "name": "Arithmetic",
  "order": 1,
  "challenges": [
    {
      "title": "Write your first Fraction",
      "description": [
        "To write your first vertical fraction using LaTeX, you'll need to add <code>\\frac{1}{2}</code>, where 1 and 2 can be any valid expression or number.",
        "Notice that if you don't use this special syntax (for example <code>3/4</code>), the fraction will be rendered horizontally. If you did it correctly the fraction will be rendered vertically",
        "In LaTeX, is necessary to enclose every math expressions between <code>\\[ \\]</code>  or <code>$$ $$</code> "
      ],
      "challengeSeed": [
        "% Write your LaTeX expression inside the delimiters",
        "\\[  \\]",
        ""
      ],
      "tests": [
        "assert(/(\\\\\\[.*\\\\\\]|\\$\\$.*\\$\\$)/g.test(expression), 'message: The expression should be enclosed by Math LaTeX equation delimiters <code>\\[ \\]</code> or <code>$$ $$</code>')",
        "assert(/\\\\frac(\\s*{.*}\\s*{.*}|\\s*(\\d|\\w)\\s*(\\d|\\w))/g.test(expression), 'message: The expression should have a valid fraction.')"
      ],
      "solutions": [
        "\\[ \\frac{1}{2} \\]"
      ]
    },
    {
      "title": "Example challenge",
      "description": [
        "This is where we put the instructions for the challenge.",
        "We can create new paragraphs by adding new strings to this array."
      ],
      "challengeSeed": [
        "% This is what appears in the LaTeX editor (which is a CodeMirror-styled text area).",
        "% You can add multiple lines of comments if necessary, and anything that follows a \"%\" will be interpreted as a comment.",
        "\\[  \\]",
        ""
      ],
      "tests": [
        "assert(/(\\\\\\[.*\\\\\\]|\\$\\$.*\\$\\$)/g.test(expression), 'message: The first part of each test is an assert statement that will run against the code the camper typed in.')",
        "assert(/\\\\frac(\\s*{.*}\\s*{.*}|\\s*(\\d|\\w)\\s*(\\d|\\w))/g.test(expression), 'message: Anything following the \"message:\" will be the message associated with a test.')"
      ],
      "solutions": [
        "% This solution is used purely for automated testing. It ensures that the following test will indeed get all the code to pass. \\[ \\frac{1}{2} \\]"
      ]
    }
  ]
}
